In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn

In [2]:
data = pd.read_csv('../data/nigerian_real_estate.csv')

data.head(10)

,bedrooms,bathrooms,toilets,parking_space,title,town,state,price
0,6,6,7,4,Detached Duplex,Victoria Island (VI),Lagos,4.500000e+08
1,5,5,6,6,Detached Duplex,Lekki,Lagos,3.000000e+08
2,4,5,6,6,Detached Duplex,Lekki,Lagos,9.000000e+07
3,6,6,7,7,Detached Duplex,Ikoyi,Lagos,1.400000e+09
4,5,5,6,4,Detached Duplex,Lekki,Lagos,1.200000e+08
5,5,6,6,None,Detached Duplex,Lekki,Lagos,2.600000e+08
6,5,6,6,None,Detached Duplex,Lekki,Lagos,3.100000e+08
7,4,4,5,2,Detached Duplex,Lekki,Lagos,7.500000e+07
8,5,5,6,1,Detached Duplex,Lekki,Lagos,3.100000e+08
9,5,5,6,None,Detached Duplex,Lekki,Lagos,3.100000e+08

In [3]:
data.shape

(24326, 8)

In [4]:
data.drop(columns=['price']).describe()

       bedrooms bathrooms toilets parking_space            title   town  state
count     24326     24326   24326         24326            24326  24326  24326
unique       10        10      10            10                7    189     25
top           5         5       6          None  Detached Duplex  Lekki  Lagos
freq       9125      8093    7605          9958            13992  10895  18445

In [5]:
data.columns

Index(['bedrooms', 'bathrooms', 'toilets', 'parking_space', 'title', 'town',
       'state', 'price'],
      dtype='object')

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24326 entries, 0 to 24325
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   bedrooms       24326 non-null  object
 1   bathrooms      24326 non-null  object
 2   toilets        24326 non-null  object
 3   parking_space  24326 non-null  object
 4   title          24326 non-null  object
 5   town           24326 non-null  object
 6   state          24326 non-null  object
 7   price          24326 non-null  float64
dtypes: float64(1), object(7)
memory usage: 1.5+ MB

In [7]:
data['bathrooms']

0           6
1           5
2           5
3           6
4           5
         ...
24321    None
24322    None
24323       3
24324    None
24325    None
Name: bathrooms, Length: 24326, dtype: object

In [8]:
data[data['bedrooms'] != "None"].count()

bedrooms         23937
bathrooms        23937
toilets          23937
parking_space    23937
title            23937
town             23937
state            23937
price            23937
dtype: int64

In [10]:
# Handling "None" in the bedrooms column

data['bedrooms'] = data['bedrooms'].replace("None", np.nan)
data['bedrooms'] = pd.to_numeric(data['bedrooms'])

In [12]:
# Handling "None" in the bathrooms column

data['bathrooms'] = data['bathrooms'].replace("None", np.nan)
data['bathrooms'] = pd.to_numeric(data['bathrooms'])

In [13]:
# Handling "None" in parking_space column

data['parking_space'] = data['parking_space'].replace("None", np.nan)
data['parking_space'] = pd.to_numeric(data['parking_space'])

In [15]:
# Handling "None" for toilets

data['toilets'] = data['toilets'].replace("None", np.nan)
data['toilets'] = pd.to_numeric(data['toilets'])

In [26]:
data = data.sample(frac=1)

In [29]:
data = data.reset_index()

In [32]:
data = data.drop(columns=['index'])

In [33]:
data

,bedrooms,bathrooms,toilets,parking_space,title,town,state,price
0,6.0,NaN,NaN,NaN,Detached Duplex,Mabushi,Abuja,450000000.0
1,4.0,NaN,NaN,NaN,Terraced Duplexes,Katampe,Abuja,800000000.0
2,4.0,NaN,NaN,NaN,Detached Duplex,Lekki,Lagos,120000000.0
3,4.0,4.0,5.0,6.0,Detached Duplex,Ajah,Lagos,40000000.0
4,4.0,4.0,5.0,2.0,Semi Detached Duplex,Lekki,Lagos,75000000.0
...,...,...,...,...,...,...,...,...
24321,2.0,2.0,2.0,NaN,Block of Flats,Kabusa,Abuja,15000000.0
24322,NaN,NaN,NaN,NaN,Block of Flats,Ado-Odo/Ota,Ogun,25000000.0
24323,4.0,NaN,NaN,NaN,Detached Duplex,Lekki,Lagos,68000000.0
24324,3.0,4.0,4.0,3.0,Block of Flats,Victoria Island (VI),Lagos,78000000.0
24325,4.0,NaN,NaN,NaN,Detached Duplex,Lekki,Lagos,65000000.0

In [35]:
data.to_csv('../data/nigerian_houses.csv', index=False)